WMSGIFT/src/Documents/итWMSПриемка/итWMSПриемка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSПриемка</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаИзТранзита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_ДокументаТранизата</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПроверены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличныхЧастейПриПроверке</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РасхожденияПМУ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАктРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацииПримкиWMS</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>КарантинПаллеты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяМарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяСерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаА</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеФизическогоНосителя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характиристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПомарочногоУчета</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДанныеМарокЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответсвиеДаннныхТТНиСкласдкогоУчета</name>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/InformationRegisters/алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры/алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Documents/ДанныеМарокЕГАИС/ДанныеМарокЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеМарокЕГАИС</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИерархияУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаА</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Марки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/Documents/итWMSПриемка/Forms/ФормаУстановкиСоответствия/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ДанныеСкладскогоУчета") Тогда 
		Отказ=Истина;
		Сообщить("Отсутствует ключевое свойство ДанныеСкладскогоУчета");
		Возврат
	КонецЕсли;	
	Если не Параметры.Свойство("ДокументыПомарочногоУчета") Тогда 
		Отказ=Истина;
		Сообщить("Отсутствует ключевое свойство ДокументыПомарочногоУчета");
		Возврат
	КонецЕсли;	
	ЗаполнитьДанныеСкладскогоУчета(Параметры.ДанныеСкладскогоУчета);
	ЗаполнитьДанныеДокументов(Параметры.ДокументыПомарочногоУчета);
	ЗаполнитьСоотвИзДокумента(Параметры.ТаблицаСоотв);
	УстановитьСпискиВыбораПолей();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСоотвИзДокумента(ТаблицаСоотв)
	ТаблицаСоответсвий.Очистить();
	Для Каждого стр из ТаблицаСоотв Цикл 
		НоваяСтрока=ТаблицаСоответсвий.Добавить();
		НоваяСтрока.СправкаБ=стр.СправкаБ;
		НоваяСтрока.АлкогольнаяПродукция=стр.АлкогольнаяПродукция;
        НоваяСтрока.Номенклатура=стр.Номенклатура;
        НоваяСтрока.ДатаРозлива=стр.ДатаРозлива;

		
		КонецЦикла;
	КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеНаСервере()
	МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;	
	ПолучитьСписокСправокБиАлкогольнойПродукции(МенеджерВременныхТаблиц);
	ПеренестиТаблицуНоменклатурыВоВременнуюТаблицу(МенеджерВременныхТаблиц);
	ЗаписатьСоответсвия(МенеджерВременныхТаблиц);
КонецПроцедуры


&НаСервере
Процедура ПолучитьСписокСправокБиАлкогольнойПродукции(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеМарокЕГАИСМарки.Марка) КАК Количество,
	|	ДанныеМарокЕГАИСМарки.СправкаБ КАК СправкаБ,
	|	ДанныеМарокЕГАИСМарки.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ПОМЕСТИТЬ ДанныеПМУ
	|ИЗ
	|	Документ.ДанныеМарокЕГАИС.Марки КАК ДанныеМарокЕГАИСМарки
	|ГДЕ
	|	ДанныеМарокЕГАИСМарки.Ссылка В(&Документы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеМарокЕГАИСМарки.СправкаБ,
	|	ДанныеМарокЕГАИСМарки.АлкогольнаяПродукция";
	
	Запрос.УстановитьПараметр("Документы", ДокументыПомарочногоУчета.Выгрузить().ВыгрузитьКолонку("Документ"));
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();
	
	
КонецПроцедуры
&НаСервере
Процедура ПеренестиТаблицуНоменклатурыВоВременнуюТаблицу(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Номенклатура,
	|	Таблица.ДатаРозлива,
	|	Таблица.Количество
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры.АлкогольнаяПродукция,
	|	Вт.Номенклатура,
	|	Вт.ДатаРозлива,
	|	Вт.Количество
	|ПОМЕСТИТЬ ВтДанныеНоменклатуры
	|ИЗ
	|	Вт КАК Вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры
	|		ПО Вт.Номенклатура = алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры.АлкогольнаяПродукция,
	|	Вт.Номенклатура,
	|	Вт.ДатаРозлива,
	|	Вт.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Вт";
	
	Запрос.УстановитьПараметр("Таблица",ДанныеСкладскогоУчета.Выгрузить());
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	
КонецПроцедуры
&НаСервере		
Процедура ЗаписатьСоответсвия(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВтДанныеНоменклатуры.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ВтДанныеНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВтДанныеНоменклатуры.ДатаРозлива КАК ДатаРозлива,
	|	ВтДанныеНоменклатуры.Количество КАК Количество,
	|	МАКСИМУМ(ДанныеПМУ.СправкаБ) КАК СправкаБ
	|ИЗ
	|	ВтДанныеНоменклатуры КАК ВтДанныеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПМУ КАК ДанныеПМУ
	|		ПО ВтДанныеНоменклатуры.АлкогольнаяПродукция = ДанныеПМУ.АлкогольнаяПродукция
	|			И ВтДанныеНоменклатуры.Количество = ДанныеПМУ.Количество
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеНоменклатуры.АлкогольнаяПродукция,
	|	ВтДанныеНоменклатуры.Номенклатура,
	|	ВтДанныеНоменклатуры.ДатаРозлива,
	|	ВтДанныеНоменклатуры.Количество";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТаблицаСоответсвий.Очистить();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока=ТаблицаСоответсвий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	УстановитьСоответствиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	МассивТаблицы=ТаблицаЗначенийВМассив("ТаблицаСоответсвий");
	ОповеститьОВыборе(МассивТаблицы);
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДанныеСкладскогоУчета(ДанныеСкладскогоУчетаДанные)
	ДанныеСкладскогоУчета.Очистить();
	Для Каждого стр из ДанныеСкладскогоУчетаДанные цикл
		НоваяСтрока=ДанныеСкладскогоУчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДанныеДокументов(ДокументыПомарочногоУчетаДанные)
	ДокументыПомарочногоУчета.Очистить();
	Для Каждого стр из ДокументыПомарочногоУчетаДанные цикл
		НоваяСтрока=ДокументыПомарочногоУчета.Добавить();
		НоваяСтрока.Документ=стр;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура УстановитьСпискиВыбораПолей()
	МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;	
	ПолучитьСписокСправокБиАлкогольнойПродукции(МенеджерВременныхТаблиц);
	ПеренестиТаблицуНоменклатурыВоВременнуюТаблицу(МенеджерВременныхТаблиц);
	УстановитьСпискиВыбораРезультат(МенеджерВременныхТаблиц);
КонецПроцедуры


&НаСервере		
Процедура УстановитьСпискиВыбораРезультат(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВтДанныеНоменклатуры.Номенклатура,
	|	ВтДанныеНоменклатуры.ДатаРозлива
	|ИЗ
	|	ВтДанныеНоменклатуры КАК ВтДанныеНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтДанныеНоменклатуры.Номенклатура,
	|	ВтДанныеНоменклатуры.ДатаРозлива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПМУ.СправкаБ,
	|	ДанныеПМУ.АлкогольнаяПродукция
	|ИЗ
	|	ДанныеПМУ КАК ДанныеПМУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПМУ.СправкаБ,
	|	ДанныеПМУ.АлкогольнаяПродукция";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаНм=МассивРезультатов[0].Выбрать();
	ВыборкаПму=МассивРезультатов[1].Выбрать();
	Пока ВыборкаНм.Следующий() Цикл
		Элементы.ТаблицаСоответсвийНоменклатура.СписокВыбора.Добавить(ВыборкаНм.Номенклатура);
		Элементы.ТаблицаСоответсвийДатаРозлива.СписокВыбора.Добавить(ВыборкаНм.ДатаРозлива);
	КонецЦикла;
	Пока ВыборкаПму.Следующий() Цикл
		Элементы.ТаблицаСоответсвийСправкаБ.СписокВыбора.Добавить(ВыборкаПму.СправкаБ);
		Элементы.ТаблицаСоответсвийАлкогольнаяПродукция.СписокВыбора.Добавить(ВыборкаПму.АлкогольнаяПродукция);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ТаблицаЗначенийВМассив(ИмяТаблицыНаФорме);
	Таблица=Вычислить(ИмяТаблицыНаФорме).Выгрузить();
	МассивТаблицы=новый Массив;
	Для Каждого стр из Таблица цикл
		СтруктураДанных=новый Структура;
		Для Каждого Колонка из Таблица.Колонки цикл
			СтруктураДанных.Вставить(Колонка.Имя,стр[Колонка.Имя]);	
		КонецЦикла;
		МассивТаблицы.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат МассивТаблицы;
КонецФункции
